-- ============================================
-- ЗАДАЧА 4.1: Студенты с оценками выше среднего по дисциплине
-- Использование параметра :arg1
-- Подзапросы в роли УСЛОВИЯ
-- ============================================

\echo '=== ОЦЕНКИ ВЫШЕ СРЕДНЕГО ПО ДИСЦИПЛИНЕ (ПАРАМЕТР :arg1) ==='
\echo 'Дисциплина: ' :arg1

SELECT 
    СТ.фамилия || ' ' || СТ.имя AS студент,
    Д.название AS дисциплина,
    У.оценка,
    (SELECT AVG(У2.оценка) FROM УСПЕВАЕМОСТЬ У2 WHERE У2.дисциплина = Д.код) AS средний_балл_по_дисциплине
FROM УСПЕВАЕМОСТЬ У
JOIN СТУДЕНТЫ СТ ON СТ.код = У.студент
JOIN ДИСЦИПЛИНЫ Д ON Д.код = У.дисциплина
WHERE Д.название = :'arg1'
  AND У.оценка > (SELECT AVG(У2.оценка) FROM УСПЕВАЕМОСТЬ У2 WHERE У2.дисциплина = Д.код)
ORDER BY У.оценка DESC;
